# St7GetGeometryEdgeLength

Returns the length of the specified edge in a given geometry face.

long St7GetGeometryEdgeLength(long uID, long EdgeNum, double* EdgeLength)
Input Parameters
uID
Strand7 model file ID.
EdgeNum
Edge number.
Output Parameters
EdgeLength
Length of the specified edge.